In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('yield_df.csv')

In [3]:
df.head(2)

,Unnamed: 0,Area,Item,Year,hg/ha_yield,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp
0,0,Albania,Maize,1990,36613,1485.0,121.0,16.37
1,1,Albania,Potatoes,1990,66667,1485.0,121.0,16.37

In [4]:
df.drop('Unnamed: 0',axis=1,inplace=True)

In [5]:
df.head(1)

,Area,Item,Year,hg/ha_yield,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp
0,Albania,Maize,1990,36613,1485.0,121.0,16.37

In [8]:
df['Item'].value_counts()

Item
Potatoes                4276
Maize                   4121
Wheat                   3857
Rice, paddy             3388
Soybeans                3223
Sorghum                 3039
Sweet potatoes          2890
Cassava                 2045
Yams                     847
Plantains and others     556
Name: count, dtype: int64

# 1. OneHotEncoding using Pandas

In [11]:
pd.get_dummies(df,columns=['Item','Area'],dtype=int,drop_first='first')

,Year,hg/ha_yield,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp,Item_Maize,Item_Plantains and others,Item_Potatoes,"Item_Rice, paddy",Item_Sorghum,...,Area_Tajikistan,Area_Thailand,Area_Tunisia,Area_Turkey,Area_Uganda,Area_Ukraine,Area_United Kingdom,Area_Uruguay,Area_Zambia,Area_Zimbabwe
0,1990,36613,1485.0,121.00,16.37,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1990,66667,1485.0,121.00,16.37,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1990,23333,1485.0,121.00,16.37,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
3,1990,12500,1485.0,121.00,16.37,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0
4,1990,7000,1485.0,121.00,16.37,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
28237,2013,22581,657.0,2550.07,19.76,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,1
28238,2013,3066,657.0,2550.07,19.76,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,1
28239,2013,13142,657.0,2550.07,19.76,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
28240,2013,22222,657.0,2550.07,19.76,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
28241,2013,22888,657.0,2550.07,19.76,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1

# With Sklearn OneHotEcoder
 When sparse=True, the encoded output is returned as a sparse matrix, while sparse=False returns a dense matrix.

In [13]:
df.head(2)

,Area,Item,Year,hg/ha_yield,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp
0,Albania,Maize,1990,36613,1485.0,121.0,16.37
1,Albania,Potatoes,1990,66667,1485.0,121.0,16.37

In [14]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.model_selection import train_test_split

In [24]:
ohe = OneHotEncoder(drop='first',dtype=int,sparse=False)

In [16]:
X = df.drop('hg/ha_yield',axis=1)
y = df['hg/ha_yield']

In [17]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [18]:
X_train.shape

(22593, 6)

In [19]:
y_train.shape

(22593,)

In [21]:
X_train.head(2)

,Area,Item,Year,average_rain_fall_mm_per_year,pesticides_tonnes,avg_temp
5493,Cameroon,Sorghum,2005,1604.0,829.59,25.36
10969,India,Soybeans,1992,1083.0,70791.00,25.91

In [25]:
new_xtrain = ohe.fit_transform(X_train[['Area','Item']])
new_xtest = ohe.transform(X_test[['Area','Item']])

In [26]:
new_xtrain

array([[0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       ...,
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 1, 0, 0],
       [0, 0, 0, ..., 1, 0, 0]])